; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v8 - type_2 ?v1 - type_3)
 	      (pred_4 ?v4 - object ?v1 - type_3)
	      (pred_3 ?v8 - type_2 ?v6 - type_1)
	      (pred_1 ?v8 - type_2 ?v4 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v8 - type_2 ?v2 ?v3 - type_3)
       :precondition (and  (pred_2 ?v8 ?v2))
       :effect (and  (pred_2 ?v8 ?v3)
		     (not (pred_2 ?v8 ?v2))))

   (:action op_2
       :parameters (?v8 - type_2 ?v5 - object ?v7 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v7) (pred_2 ?v8 ?v7) (pred_3 ?v8 ?v6))
       :effect (and (pred_1 ?v8 ?v5 ?v6)
		    (not (pred_4 ?v5 ?v7)) 
		    (not (pred_3 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_2 ?v5 - object ?v7 - type_3 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v5 ?v6) (pred_2 ?v8 ?v7))
       :effect (and (pred_4 ?v5 ?v7)
		    (pred_3 ?v8 ?v6)
		    (not (pred_1 ?v8 ?v5 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_2
obj_04 obj_08 - type_1
obj_09 obj_03 obj_05 obj_06 - type_3
obj_07 obj_01 obj_02 - object)
(:init
(pred_2 obj_10 obj_05)
(pred_3 obj_10 obj_04)
(pred_3 obj_10 obj_08)
(pred_4 obj_07 obj_09)
(pred_4 obj_01 obj_05)
(pred_4 obj_02 obj_05)
)
(:goal
(and
(pred_4 obj_07 obj_03)
(pred_4 obj_01 obj_06)
(pred_4 obj_02 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_10 ?b obj_08))))
)
)

; plan
1. (op_2 obj_10 obj_01 obj_05 obj_04)
   deleted: (pred_4 obj_01 obj_05) (pred_3 obj_10 obj_04)
   added: (pred_1 obj_10 obj_01 obj_04)
   goals met: 1 of 3
2. (op_3 obj_10 obj_05 obj_06)
   deleted: (pred_2 obj_10 obj_05)
   added: (pred_2 obj_10 obj_06)
   goals met: 1 of 3
3. (op_1 obj_10 obj_01 obj_06 obj_04)
   deleted: (pred_1 obj_10 obj_01 obj_04)
   added: (pred_4 obj_01 obj_06) (pred_3 obj_10 obj_04)
   goals met: 2 of 3
4. (op_3 obj_10 obj_06 obj_09)
   deleted: (pred_2 obj_10 obj_06)
   added: (pred_2 obj_10 obj_09)
   goals met: 2 of 3
5. (op_2 obj_10 obj_07 obj_09 obj_04)
   deleted: (pred_4 obj_07 obj_09) (pred_3 obj_10 obj_04)
   added: (pred_1 obj_10 obj_07 obj_04)
   goals met: 2 of 3
6. (op_3 obj_10 obj_09 obj_03)
   deleted: (pred_2 obj_10 obj_09)
   added: (pred_2 obj_10 obj_03)
   goals met: 2 of 3
7. (op_1 obj_10 obj_07 obj_03 obj_04)
   deleted: (pred_1 obj_10 obj_07 obj_04)
   added: (pred_4 obj_07 obj_03) (pred_3 obj_10 obj_04)
   goals met: 3 of 3
